# 4.5 IC Consistency Checks

## 1. Walkthrough
## 1a Importing Libraries and Data
## 1b. Mixed Data Types
## 1c. Finding Missing Values and Fixing them
## 1d. Finding and fixing duplicates
## 1e. Export Data to prepared data folder
## 2. Task
## 2a. run df.describe on df_prods
## 2b. checked for mixed data type in ords
## 2c. check ords for missing values
## 2d. Address missing values
## 2e. Check ords for duplicate values
## 2f. export df_ords

### 1a. Importing Libraries and Data

In [1]:
# Importing Libraries

In [2]:
import pandas as pd
import numpy as np
import os

In [3]:
# Import Products.csv

In [4]:
path = r'/Users/bethanybreed/Documents/A Career Foundry/07-2022 Instacart Basket Analysis'

In [5]:
df_prods = pd.read_csv(os.path.join(path, '02 Data', 'original data', 'products.csv'), index_col = False)

In [6]:
# Import orders.csv

In [7]:
vars_list = ['order_id', 'user_id', 'order_number', 'order_dow', 'order_hour_of_day', 'days_since_prior_order']

In [8]:
df_ords = pd.read_csv(os.path.join(path, '02 Data', 'original data', 'orders.csv'), usecols = vars_list)

### 1b. Mixed Data Types

In [9]:
# Create a dataframe to test mixed data types

In [10]:
df_test = pd.DataFrame()

In [11]:
# Create a mixed type column

In [12]:
df_test['mix']=['a','b',1,True]

In [13]:
df_test.head()

    mix
0     a
1     b
2     1
3  True

In [14]:
# Check for mixed data types

In [15]:
for col in df_test.columns.tolist():
  weird = (df_test[[col]].applymap(type) != df_test[[col]].iloc[0].apply(type)).any(axis = 1)
  if len (df_test[weird]) > 0:
    print (col)

mix

In [16]:
#convert column to string

In [17]:
df_test['mix'] = df_test['mix'].astype('str')

### 1c. Finding Missing Values and Fixing them

In [18]:
#Find missing values

In [19]:
df_prods.isnull().sum()

product_id        0
product_name     16
aisle_id          0
department_id     0
prices            0
dtype: int64

In [20]:
#Figure out what the missing values are

In [21]:
df_nan=df_prods[df_prods['product_name'].isnull() == True]

In [22]:
df_nan

       product_id product_name  aisle_id  department_id  prices
33             34          NaN       121             14    12.2
68             69          NaN        26              7    11.8
115           116          NaN        93              3    10.8
261           262          NaN       110             13    12.1
525           525          NaN       109             11     1.2
1511         1511          NaN        84             16    14.3
1780         1780          NaN       126             11    12.3
2240         2240          NaN        52              1    14.2
2586         2586          NaN       104             13    12.4
3159         3159          NaN       126             11    13.1
3230         3230          NaN       120             16    14.4
3736         3736          NaN        41              8    14.8
4283         4283          NaN        77              7    14.4
4790         4790          NaN        91             16    14.5
38187       38183          NaN        39             12    20.9
40444       40440          NaN       120             16    14.8

In [23]:
#Because the missing values are string we will create a new dataframe without these values

In [24]:
df_prods.shape

(49693, 5)

In [25]:
df_prods_clean = df_prods[df_prods['product_name'].isnull() == False]

In [26]:
df_prods_clean.shape

(49677, 5)

In [27]:
# 49693-49677 = 16 which was the number of missing values we had

### 1d. Finding and fixing duplicates

In [28]:
#look for FULL duplicates

In [29]:
df_dups = df_prods_clean[df_prods_clean.duplicated()]

In [30]:
df_dups

,product_id,product_name,aisle_id,department_id,prices
462,462,Fiber 4g Gummy Dietary Supplement,70,11,4.8
18459,18458,Ranger IPA,27,5,9.2
26810,26808,Black House Coffee Roasty Stout Beer,27,5,13.4
35309,35306,Gluten Free Organic Peanut Butter & Chocolate ...,121,14,6.8
35495,35491,Adore Forever Body Wash,127,11,9.9

In [31]:
#Check rows to compare after deleting

In [32]:
df_prods_clean.shape

(49677, 5)

In [33]:
# Delete duplicates

In [34]:
df_prods_clean_no_dups = df_prods_clean.drop_duplicates()

In [35]:
df_prods_clean_no_dups.shape

(49672, 5)

In [36]:
#this is 5 less than the original and 5 is exactly how many our df_dups showed

### 1e. Export Data to prepared data folder

In [37]:
df_prods_clean_no_dups.to_csv(os.path.join(path, '02 Data','Prepared Data', 'products_checked.csv'))

# 2 Task for 4.5

In [38]:
#orders.csv has already been imported

### 2a. run df.describe on df_prods

In [39]:
df_prods.describe()

         product_id      aisle_id  department_id        prices
count  49693.000000  49693.000000   49693.000000  49693.000000
mean   24844.345139     67.770249      11.728433      9.994136
std    14343.717401     38.316774       5.850282    453.519686
min        1.000000      1.000000       1.000000      1.000000
25%    12423.000000     35.000000       7.000000      4.100000
50%    24845.000000     69.000000      13.000000      7.100000
75%    37265.000000    100.000000      17.000000     11.200000
max    49688.000000    134.000000      21.000000  99999.000000

In [40]:
#looking for odd items
#count is the same for each column
#prices has a max of 99,999 which seems high, might want to check that item, esp as the mean price is $10

In [41]:
# In case the task was meaning for me to take a glance at ords to prep for following questions
df_ords.describe()

,order_id,user_id,order_number,order_dow,order_hour_of_day,days_since_prior_order
count,3.421083e+06,3.421083e+06,3.421083e+06,3.421083e+06,3.421083e+06,3.214874e+06
mean,1.710542e+06,1.029782e+05,1.715486e+01,2.776219e+00,1.345202e+01,1.111484e+01
std,9.875817e+05,5.953372e+04,1.773316e+01,2.046829e+00,4.226088e+00,9.206737e+00
min,1.000000e+00,1.000000e+00,1.000000e+00,0.000000e+00,0.000000e+00,0.000000e+00
25%,8.552715e+05,5.139400e+04,5.000000e+00,1.000000e+00,1.000000e+01,4.000000e+00
50%,1.710542e+06,1.026890e+05,1.100000e+01,3.000000e+00,1.300000e+01,7.000000e+00
75%,2.565812e+06,1.543850e+05,2.300000e+01,5.000000e+00,1.600000e+01,1.500000e+01
max,3.421083e+06,2.062090e+05,1.000000e+02,6.000000e+00,2.300000e+01,3.000000e+01

In [42]:
#looking for odd items in ords.csv
# they all have the same count
#order id and user id should be string, same with order number
#day of week seems fine, starts with 0 goes to 6, mean is just shy of 3
#hour of day seems off, with min being 0 is fine but max is only 23? there are 24 hours in the day 
#there are no negatives in days since prior which is good, max is 30, but median and mean are very different
#for days since prior median is 7 whereas mean is 11, so seems like some outliers might be pulling it up

### 2b. checked for mixed data type in ords

In [43]:
for col in df_ords.columns.tolist():
  weird = (df_ords[[col]].applymap(type) != df_ords[[col]].iloc[0].apply(type)).any(axis = 1)
  if len (df_ords[weird]) > 0:
    print (col)

In [44]:
#nothing printed so no mixed data types in ords

### 2c. check ords for missing values

In [45]:
df_ords.isnull().sum()

order_id                       0
user_id                        0
order_number                   0
order_dow                      0
order_hour_of_day              0
days_since_prior_order    206209
dtype: int64

In [46]:
#days since prior order has 206,209 missing values.  
#This could be that they ordered on the same day, or they never ordered a second time and after a point it goes null

### 2d. Address missing values

In [47]:
# view missing values

In [48]:
df_miss = df_ords[df_ords['days_since_prior_order'].isnull() == True]

In [49]:
df_miss

,order_id,user_id,order_number,order_dow,order_hour_of_day,days_since_prior_order
0,2539329,1,1,2,8,NaN
11,2168274,2,1,2,11,NaN
26,1374495,3,1,1,14,NaN
39,3343014,4,1,6,11,NaN
45,2717275,5,1,3,12,NaN
...,...,...,...,...,...,...
3420930,969311,206205,1,4,12,NaN
3420934,3189322,206206,1,3,18,NaN
3421002,2166133,206207,1,6,19,NaN
3421019,2227043,206208,1,1,15,NaN
3421069,3154581,206209,1,3,11,NaN

In [50]:
#missing values are integers, based off my describe I plan to use the median, I believe with 30 days being the high and 0 being the low there are some outliers pulling the mean upwards

In [51]:
df_ords.median()

order_id                  1710542.0
user_id                    102689.0
order_number                   11.0
order_dow                       3.0
order_hour_of_day              13.0
days_since_prior_order          7.0
dtype: float64

In [52]:
df_ords['days_since_prior_order'].fillna('median', inplace=True)

In [53]:
#double check missing values are cleared up now

In [54]:
df_ords.isnull().sum()

order_id                  0
user_id                   0
order_number              0
order_dow                 0
order_hour_of_day         0
days_since_prior_order    0
dtype: int64

### 2e. Check ords for duplicate values

In [55]:
#create subset of duplicates
df_dups2 = df_ords[df_ords.duplicated()]

In [56]:
df_dups2

Empty DataFrame
Columns: [order_id, user_id, order_number, order_dow, order_hour_of_day, days_since_prior_order]
Index: []

In [57]:
#when i printed df_dups2 it did not show any values for duplicates so I don't believe there are any duplicates in ords.csv

### 2f. export df_ords

In [58]:
df_ords.to_csv(os.path.join(path, '02 Data','Prepared Data', 'orders_checked.csv'))